[
   {
        "heroName": "Joseph Chatoyer",
        "birthdate": "unknown - March 14, 1795",
        "photo": "https://miro.medium.com/max/700/0*qvUOj5gBCBPr-RSY",
        "notableAccomplishments": "Led a revolt against the British colonial government of Saint Vincent in 1795.",
        "description": "In 1772, the population rebelled. Led by Chatoyer, the First Carib War forced the British to sign a treaty with them in 1773. This was the first time Britain had been forced to sign an accord with non-white people in the Caribbean. By 1795, it became apparent to the local population that Britain had no intention of obeying the treaty. The people of the Caribbean then rose in rebellion and were joined by a group of French radicals, inspired by the ideals of the French Revolution, who saw Britain as a traditional enemy of France. In the Second Carib War, Chatoyer divided the island with his brother Duvalle, who was another chieftain. Duvalle had a Guadeloupean lieutenant by the name of Massoteau. Working his way along the coast, Chatoyer was met by his French supporters at Chateaubelair, and together the forces worked their way to Dorsetshire Hill, from where they would launch their attack on the capital city, Kingstown. On March 14, a battalion of British soldiers led by General Ralph Abercromby, marched toward Dorsetshire Hill. That night, Chatoyer was killed by Major Alexander Leith. Though the rebellion continued until October 1796 under the leadership of Duvalle, Chatoyer's death led to the desertion of the French supporters and without their aid, the tide of the war turned in favour of the British. As a national hero of Saint Vincent and the Grenadines, Chatoyer is recognized with a monument on Dorsetshire Hill, where he died."
    },
    {
        "heroName": "Thomas Vincent Ramos",
        "birthdate": "September 17, 1887 - November 13, 1955",
        "photo": "https://adeleramosbz.files.wordpress.com/2014/05/t-v-ramos-2006.gif?w=199&h=283",
        "notableAccomplishments": "Civil rights activist and founder of Garifuna Settlement Day",
        "description": "After moving to British Honduras, Ramos became a school teacher. He was also a visionary leader. Concerned about the systematic neglect of health facilities for Garinagu in Stann Creek Town, he founded the Carib Development and Sick Aid Society and later the Carib International Society, which had affiliations in Guatemala and Honduras. The purpose of the Carib Development Society was to help the sick and to assist those who need financial assistance to bury their dead. The society owns 800 acres (3.2 km2) of land that was called the Carib Reserve at Sarawee in the Stann Creek valley.He lobbied successfully for the colonial authorities to provide native Garifuna nurses in the local hospital. Ramos was a Methodist, a preacher, and wrote several Garifuna hymns. Some of them are sung each year at his memorial.T. V. Ramos was a contemporary of Marcus Garvey, and was involved in Garvey's Universal Negro Improvement Association. He fought discrimination against Garifuna people, including all Afro-Belizeans. He was founder of the Independent Manhood and Exodus Uplift Society and the Colonial Industrial Instruction Association.He was a prolific contributor to the newspapers. For example, writing in the Belize Independent on 21 January 1942 Ramos complained of the brutality of some Wesleyan School teachers towards their students, and the immorality of some of the female pupil teachers. In 1940, as leader and spokesman of the Garifuna people along with Pantaleon Hernandez and Domingo Ventura he approached the governor of the colony and asked for establishment of a public and bank holiday to observe the Garifuna arrival in Belize. The request was granted and the Carib Disembarkation Day, later named Garifuna Settlement Day, was first celebrated in Stann Creek District on 19 November 1941. The holiday was recognized in Toledo District in 1943 and throughout the country in 1977."
    },
    {
       "heroName": "Alejo Beni",
        "birthdate": "Unknown",
        "photo": "https://pbs.twimg.com/media/EQbT-BGW4AEarCF?format=jpg&name=large",
        "notableAccomplishments": "Civil rights activist and founder of Garifuna Settlement Day",
        "description": "On November 19, 1832, Alejo Beni led a group of Garifuna to the southern Belizean coastline following the republican revolt, where they had no option but to flee. Garinagu continued their epic exodus in even greater numbers settling across Belize between the early 1830s and 1900s. Belize is the only country in the world where Garifuna Settlement Day is both a federal and bank holiday. Garifuna Settlement Day in Belize consist of reenactments of the arrival of the Garifuna people by way of a dory (dug-out canoe), and other celebrations." 
    }
 
]
    